; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   white_block_1 red_block_1 brown_block_1 black_block_1 green_block_1 brown_block_2 black_block_2 - block
 )
 (:init (ontable white_block_1) (on red_block_1 white_block_1) (ontable brown_block_1) (on black_block_1 brown_block_1) (on green_block_1 red_block_1) (on brown_block_2 black_block_1) (ontable black_block_2) (clear green_block_1) (clear brown_block_2) (clear black_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (on brown_block_1 green_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack brown_block_2 black_block_1)
   deleted: (on brown_block_2 black_block_1) (clear brown_block_2) (handempty)
   added: (holding brown_block_2) (clear black_block_1)
   goals met: 0 of 1
2. (stack brown_block_2 black_block_2)
   deleted: (clear black_block_2) (holding brown_block_2)
   added: (handempty) (clear brown_block_2) (on brown_block_2 black_block_2)
   goals met: 0 of 1
3. (unstack black_block_1 brown_block_1)
   deleted: (on black_block_1 brown_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear brown_block_1)
   goals met: 0 of 1
4. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 0 of 1
5. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1)
   goals met: 0 of 1
6. (stack brown_block_1 green_block_1)
   deleted: (clear green_block_1) (holding brown_block_1)
   added: (handempty) (clear brown_block_1) (on brown_block_1 green_block_1)
   goals met: 1 of 1
